rottenpotatoes/app/controllers/movies_controller.rb

  def same_director
    @movies = Movie.same_director params[:id]
    if @movies.count == 0
      flash[:notice] = "'#{Movie.find(params[:id]).title}' has no director info"
---
SELECT COUNT(*) FROM "movies" WHERE "movies"."director" = 'George Lucas'
SELECT "movies".* FROM "movies" WHERE "movies"."id" = ? LIMIT 1  [["id", "1"]]